#include<iostream>
using namespace std;

int main()
{
	//1.数据类型 数组名[行数][列数];
	int arr[2][4];
	
	//对数组内元素进行赋值
	arr[0][0] = 1;
	arr[0][1] = 2;
	arr[0][2] = 3;
	arr[0][3] = 4;
	arr[1][0] = 5;
	arr[1][1] = 6;
	arr[1][2] = 7; 
	arr[1][3] = 8;
	
	//使用for语句输出所有
	for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 4; j++)
		{
			cout << arr[i][j]<<"  ";
		}
	}
	cout << endl;

	//推荐！
	
	//2.数据类型 数组名[行数][列数] =	
	//{
	// {数据1,数据2},
	// {数据3,数据4}
	//}
	int arr2[2][4] =
	{
		{1,2,3,4},
		{5,6,7,8}
	};

	//3.数据类型 数据名[行数][列数] = 
	//{
	//	数据1,数据2,数据3,数据4
	//};
	int arr3[2][4] = { 1,2,3,4,5,6,7,8 };
	

	//4.数据类型 数组名[][列数] = 
	//	{1,2,3,4,5,6,7,8};
	int arr4[][4] = { 1,2,3,4,5,6,7,8 };
	

	cout << endl;

	system("pause");
	return 0;
}